-- Связываем книги с жанрами
INSERT INTO Book_Genres (book_id, genre_id) VALUES
-- Преступление и наказание (1)
(1, 1), (1, 6),
-- Братья Карамазовы (2)
(2, 1), (2, 6),
-- Война и мир (3)
(3, 1), (3, 6),
-- Мастер и Маргарита (4)
(4, 1), (4, 6), (4, 7),
-- 1984 (5)
(5, 5), (5, 6),
-- Гарри Поттер (6)
(6, 3), (6, 7),
-- Властелин колец (7)
(7, 3), (7, 7),
-- Убить пересмешника (8)
(8, 1), (8, 6),
-- 451 градус (9)
(9, 2), (9, 5),
-- Над пропастью (10)
(10, 1), (10, 6),
-- Алиса (11)
(11, 3), (11, 7),
-- Дюна (12)
(12, 2), (12, 7),
-- Шерлок Холмс (13)
(13, 4), (13, 1),
-- Портрет Дориана Грея (14)
(14, 1), (14, 6),
-- Фауст (15)
(15, 1), (15, 6),
-- Дракула (16)
(16, 8), (16, 6),
-- Франкенштейн (17)
(17, 2), (17, 8),
-- Анна Каренина (18)
(18, 1), (18, 6);