SET NAMES utf8mb4;

INSERT INTO Genres (genre_name) VALUES
('Классическая литература'),
('Фантастика'),
('Детектив'),
('Роман'),
('Фэнтези');

INSERT INTO Book (isbn, title, author, year_publication, publisher) VALUES
('978-5-699-12345-1', 'Преступление и наказание', 'Фёдор Достоевский', 1866, 'Азбука'),
('978-5-699-12346-8', 'Братья Карамазовы', 'Фёдор Достоевский', 1880, 'Азбука'),
('978-5-699-12347-5', 'Идиот', 'Фёдор Достоевский', 1869, 'Азбука'),
('978-5-699-12348-2', 'Война и мир', 'Лев Толстой', 1869, 'Азбука'),
('978-5-699-12349-9', 'Анна Каренина', 'Лев Толстой', 1878, 'Азбука'),
('978-5-699-12350-5', 'Мастер и Маргарита', 'Михаил Булгаков', 1967, 'Азбука'),
('978-5-699-12351-2', 'Собачье сердце', 'Михаил Булгаков', 1925, 'Азбука'),
('978-5-699-22345-1', 'Пикник на обочине', 'Аркадий Стругацкий', 1972, 'АСТ'),
('978-5-699-22346-8', 'Трудно быть богом', 'Борис Стругацкий', 1964, 'АСТ'),
('978-5-699-22347-5', 'Дозоры', 'Сергей Лукьяненко', 1998, 'АСТ');

INSERT INTO Book_Genres (book_id, genre_id) VALUES
(1,1), (2,1), (3,1), (4,1), (5,1),
(6,1), (7,1), (8,2), (9,2), (10,2);