SET NAMES utf8mb4 COLLATE utf8mb4_unicode_ci;

INSERT INTO Genres (genre_name) VALUES
('Классическая литература'),
('Фантастика'),
('Детектив');

INSERT INTO Book (isbn, title, author, year_publication, publisher) VALUES
('978-5-699-12345-1', 'Преступление и наказание', 'Фёдор Достоевский', 1866, 'Азбука'),
('978-5-699-12346-8', 'Братья Карамазовы', 'Фёдор Достоевский', 1880, 'Азбука'),
('978-5-699-12347-5', 'Идиот', 'Фёдор Достоевский', 1869, 'Азбука'),
('978-5-699-12348-2', 'Война и мир', 'Лев Толстой', 1869, 'Азбука'),
('978-5-699-12349-9', 'Анна Каренина', 'Лев Толстой', 1878, 'Азбука');

INSERT INTO Book_Genres (book_id, genre_id) VALUES
(1,1), (2,1), (3,1), (4,1), (5,1);