INSERT INTO Genres (genre_name) VALUES 
('Фантастика'), ('Детектив'), ('Роман'), ('Классика'), ('Фэнтези');

INSERT INTO Book (isbn, title, author, year_publication) VALUES
('978-001', 'Мастер и Маргарита', 'Булгаков М.А.', 1967),
('978-002', 'Преступление и наказание', 'Достоевский Ф.М.', 1866),
('978-003', 'Гарри Поттер', 'Роулинг Дж.', 1997),
('978-004', '1984', 'Оруэлл Дж.', 1949),
('978-005', 'Властелин колец', 'Толкин Дж.Р.Р.', 1954),
('978-006', 'Анна Каренина', 'Толстой Л.Н.', 1877),
('978-007', 'Война и мир', 'Толстой Л.Н.', 1869),
('978-008', 'Идиот', 'Достоевский Ф.М.', 1869),
('978-009', 'Братья Карамазовы', 'Достоевский Ф.М.', 1880),
('978-010', 'Хоббит', 'Толкин Дж.Р.Р.', 1937);

INSERT INTO Book_Genres (book_id, genre_id) VALUES
(1, 3), (1, 4), (2, 3), (2, 4), (3, 5), (4, 1), (4, 3), 
(5, 5), (6, 3), (6, 4), (7, 3), (7, 4), (8, 3), (8, 4), 
(9, 3), (9, 4), (10, 5);

INSERT INTO Users (login, password_hash, age, location) VALUES
('user1', 'hash1', 25, 'Москва'),
('user2', 'hash2', 30, 'СПб'),
('user3', 'hash3', 22, 'Казань'),
('user4', 'hash4', 28, 'Новосибирск'),
('user5', 'hash5', 35, 'Екатеринбург');

INSERT INTO Ratings (user_id, book_id, rating, rated_at) VALUES
(1, 1, 5, NOW()), (1, 2, 5, NOW()), (1, 6, 4, NOW()), 
(1, 7, 4, NOW()), (1, 8, 5, NOW()), (1, 9, 5, NOW()),
(2, 3, 5, NOW()), (2, 5, 5, NOW()), (2, 10, 4, NOW()),
(2, 1, 3, NOW()), (2, 4, 2, NOW()),
(3, 4, 5, NOW()), (3, 1, 4, NOW()), (3, 5, 3, NOW()),
(3, 3, 2, NOW()), (3, 10, 4, NOW()),
(4, 1, 4, NOW()), (4, 2, 4, NOW()), (4, 3, 4, NOW()),
(4, 4, 3, NOW()), (4, 5, 4, NOW()),
(5, 2, 5, NOW()), (5, 8, 5, NOW()), (5, 9, 5, NOW()),
(5, 1, 4, NOW()), (5, 6, 3, NOW());

INSERT INTO User_Preferences (user_id, genre_id) VALUES
(1, 4), (1, 3), (2, 5), (3, 1), (4, 3), (5, 4);